client/artillery-test.yaml
config:
  target: "http://localhost:8000" # The HTTP relay server URL
  phases:
    - duration: 60 # Test duration: 120 seconds
      arrivalRate: 200 # 20 new virtual users per second
      rampTo: 500 # Ramp up to 50 users per second
scenarios:
  - flow:
      - get:
          url: "/api/example1" # Sample GET request
      - think: 0.5 # Wait for 0.5 seconds before sending the next request
      - post:
          url: "/api/example2" # Sample POST request
          json:
            message: "Sample POST event"
      - think: 0.5
      - put:
          url: "/api/example3" # Sample PUT request
          json:
            message: "Sample PUT event"
      - think: 0.5
      - delete:
          url: "/api/example4" # Sample DELETE request
      - think: 0.5
      - get:
          url: "/api/example5" # Another GET request
      - think: 0.5
      - post:
          url: "/api/example6" # Another POST request
          json:
            message: "Another POST event"
      - think: 0.5
      - get:
          url: "/api/example7" # Another GET request
      - think: 0.5
      - put:
          url: "/api/example8" # Another PUT request
          json:
            message: "Another PUT event"
      - think: 0.5
      - delete:
          url: "/api/example9" # Another DELETE request