client/artillery-test.yaml
# Load test for the CAPTURE plane (127.0.0.1:8001). Artillery targets one base
# URL, so channel creation is a pre-step on the control plane (:8000):
#
#   curl -X PUT localhost:8000/api/channels/loadtest -d '{"rate_limit":{"burst":5000,"refill_per_s":5000}}'
#
# Run:
#   npx artillery run client/artillery-test.yaml

config:
  target: "http://127.0.0.1:8001"
  phases:
    - duration: 30      # 30 seconds
      arrivalRate: 50   # start at 50 new virtual users per second
      rampTo: 200       # ramp to 200 new virtual users per second by the end of the phase
  ensure:
    - http.response_time.p95: 50   # fail the run if p95 latency rises above 50 ms
    - http.response_time.p99: 200  # fail the run if p99 latency rises above 200 ms

scenarios:
  - flow:
      - post:
          url: "/c/loadtest/load"
          json:
            seq: "{{ $randomNumber(1,1000000) }}"
      - think: 0.1      # 0.1 seconds between requests per virtual user